/* ==========================================================
 * d2warden
 * https://github.com/lolet/d2warden
 * ==========================================================
 * Copyright 2011-2013 Bartosz Jankowski
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 * ========================================================== */

#include "stdafx.h"
#include "D2Handlers.h"

#include "D2Warden.h"
#include "LSpectator.h"
#include "LRoster.h"
#include "LItems.h"
#include "LEvents.h"
#include "LMonsters.h"
#include "LWorldEvent.h"
#include "process.h"

#include "Build.h"

map<string,int> Dane;

void  __stdcall OnLastHit(UnitAny* ptKiller, UnitAny * ptVictim, Damage * ptDamage)
{
	if(ptKiller->dwType==UNIT_PLAYER && ptVictim->dwType==UNIT_PLAYER) {
		if(D2Funcs::D2COMMON_GetStatSigned(ptVictim,STAT_HP,0) <=0)
		{ 
			int Dmg = (int)ptDamage->DamageTotal >> 8;
			if(Dmg>50000) return;
			if(Dmg>ptKiller->pGame->DmgRekord) {

		{
			ClientData * pClient = pPlayerData->pClientData;
			if(pClient)
			{
				ReassignPacket hReassign = {0};
				//::memset(&hReassign,0,11);
				hReassign.Header= 0x15;
				hReassign.UnitId = ptPlayer->dwUnitId;
				hReassign.xPos = UnitX;
				hReassign.yPos = UnitY;
				hReassign.Reassign = 1;

				D2Funcs::D2GAME_SendPacket(pClient,(BYTE*)&hReassign,11);
			}
		}
		return 1;
	}
	return 3;
}

int  __fastcall d2warden_0X66Handler(Game* ptGame, UnitAny* ptPlayer, BYTE *ptPacket, int PacketLen) // Pakiet 66 -> Odpowiedz klienta na zapytanie Wardena
{
	// Mozliwe wartosci zwrotu kazdego pakietu:
	// 0 - wszystko ok
	// 1 - ?
	// 2 - blad
	// 3 - hack 

	DWORD ClientID = ptPlayer->pPlayerData->pClientData->ClientID;
	
	if (PacketLen < 3)	{
	Log("WardenPacket: Pakiet krotszy niz 3!");
	return 3;
	}
	
	if(!ClientID) {
	Log("WardenPacket: Brak numeru klienta!");
	return 3;
	}

	WardenPacket *New66 = new WardenPacket;
	if (!New66)	
	{
	Log("WardenPacket: Brak pamieci na alokacje pakietu klienta!");
	return 3; // Brak pamieci
	}
	
	New66->ReceiveTime = GetTickCount();
	New66->PacketLen = ptPacket[2]*256 + ptPacket[1];
	
	if (New66->PacketLen == 0 || New66->PacketLen > 512) // Taka jest maksymalna wielkosc pakietu obslugiowanego przez d2
	{
		Log("WardenPacket: Otrzymano pakiet przekraczajacy 512 bajtow!");
		delete New66;
		return 3;
	}
	
	BYTE *ThePacket = new BYTE[New66->PacketLen];
	if (!ThePacket)
	{
		Log("WardenPacket: Brak pamieci na alokacje pakietu klienta!");
		delete New66; // Brak pamieci
		return 3;
	}
	memcpy(ThePacket,ptPacket+3,New66->PacketLen);
	
	New66->ThePacket = ThePacket;

	list<WardenClient>::iterator i = GetClientByID(ClientID);

	if(i != hWarden.Clients.end())		{
			if(!i->ptPlayer)     i->ptPlayer=ptPlayer;
			if(!i->ptGame)       i->ptGame=ptGame;
			if(!i->ptClientData) i->ptClientData = ptPlayer->pPlayerData->pClientData;
			if(i->AccountName.empty())  i->AccountName = i->ptClientData->AccountName;  
			if(i->CharName.empty())  i->CharName = i->ptClientData->CharName;

			rc4_crypt(i->RC4_KEY_0X66,New66->ThePacket,New66->PacketLen);

			i->pWardenPackets_ReceiveTime = New66->ReceiveTime;
			i->pWardenPackets = New66;
			i->NextCheckTime = GetTickCount();
			UNLOCK
			return 0; // Wszystko OK!
	}


		delete[] New66->ThePacket;
		delete New66;
#ifdef _ENGLISH_LOGS
		Log("WardenPacket: Unexpected packet from player'%s'! Returning an error..",ptPlayer->pPlayerData->szName);
#else
		Log("WardenPacket: Nieoczekiwany pakiet od gracza '%s'! Zwracam blad...",ptPlayer->pPlayerData->szName);
#endif
		return 3;

}


int  __fastcall d2warden_0X68Handler(PacketData *pPacket) // 0x68 pakiet -> Dodaj nowego klienta do petli Wardena
{
// Moje badania :
// [37] 0x68 Join Game [DWORD Server Hash] [WORD Server Token] [BYTE ClassId] [DWORD VerByte (0x0b)] [DWORD Unknown] [DWORD Unknown] [BYTE LocaleID] [char Name[16]]
#pragma pack(push, 1)
struct px68
{
	BYTE Header;			// 0x00
	DWORD ServerHash;		// 0x01 rowniez SessionKey - do utrzymania polaczenia z BN
	WORD ServerToken;		// 0x05 TicketNo - zwieksza sie z kazdym wejsciem gracza.
	BYTE ClassId;			// 0x07
	DWORD VerByte;			// 0x08 (koncowka (11 dla 1.11) etc
	DWORD Unk1;				// 0x0C FOG_isExpansion_10227() != 0 ? 0xED5DCC50u : 0x2185EDD6u; (stala)
	DWORD Unk2;				// 0x10 0x91A519B6 (stala)
	BYTE LocaleId;			// 0x14 
	char szCharName[16];	// 0x15
};
struct px67 //Create Game 0x2E
{
	BYTE Header;			// 0x00
	char szGameName[16];	// 0x01
	BYTE GameType;			// 0x11
	BYTE ClassId;			// 0x12
	BYTE ArenaUnk;			// 0x13
	BYTE DiffLvl;			// 0x14
	char szCharName[16];	// 0x15
	WORD Unk1;				// 0x25
	DWORD ArenaFlags;		// 0x27
	BYTE Unk2;				// 0x2B
	BYTE Unk3;				// 0x2C
	BYTE LocaleId;			// 0x2D
};
#pragma pack(pop)


//	unsigned char RC4_KEY_0X66[16],RC4_KEY_0XAE[16];
	px68* pJoinPacket = (px68*)pPacket->aPacket;
	px67* pCreatePacket = (px67*)pPacket->aPacket;

#ifdef _SINGLEPLAYER
	if(pJoinPacket->Header !=0x68 || pCreatePacket->Header !=0x67 ) return 0;
		if(pCreatePacket->Header == 0x67) {
		Dane[pCreatePacket->szCharName] = 0;
		return 0;
		}
#endif


	int D2Version = pJoinPacket->VerByte;

	if (D2Version < 16 && !AllowVanilla) /// Zmiana na 14 11.04.11 . Zmiana na 15 08.07.11. Zmiana na 16 02.02.12
	{
		KickPlayer(pPacket->ClientID);
		if(D2Version==11)
#ifdef _ENGLISH_LOGS
		Log("NewClient: Dropping connection with '%s', reason : No D2Ex2 installed.",pJoinPacket->szCharName);
#else
		Log("NowyKlient: Zrywam polaczenie z graczem '%s', powod : Brak D2Ex.",pJoinPacket->szCharName);
#endif
		else
#ifdef _ENGLISH_LOGS
